const hoverData=['家常菜40076','快手菜40077', '下饭菜40078', '早餐40071', '减肥30048',
 '汤羹20130', '烘焙51761', '小吃40073', '猪肉731', '鸡肉1136', '牛肉1445', '鱼957', '鸡蛋394', '土豆206', '茄子178',
  '豆腐80', '小龙虾5322', '笋534', '椰子2819', '龙虾2918', '柠檬1299', '榴莲602' ,'山药524' ,'莴笋1010303'];
const hot=[['菜式','家常菜40076', '快手菜40077', '下饭菜40078', '素菜51848', '大鱼大肉52354', '下酒菜51743',  '小清新52351', '创意菜51940' ],
['特色食品','酱51276','沙拉20176','凉菜20137','零食40074', '三明治20157', '月饼20152', '蒸蛋52335', '寿司20172', '粽子51870'], 
['特殊场合','早餐40071','下午茶40072', '便当20171','宵夜51865', '圣诞节51971', '年夜饭40075', '深夜食堂52107'],
['功效', '减肥30048', '美容52318', '润肺抗燥30053', '补血30051', '清热去火52334'], 
['人群', '儿童30042', '婴幼儿30044', '老人30043', '孕产妇52333', '宝宝食谱1012138'] 
]
const cake=[['蛋糕烘焙','烘焙51761', '蛋糕20158', '面包52411', '饼干20160', '吐司52447', '乳酪蛋糕52435', '曲奇51906' ]
    ,['饮料甜品','甜品20135', '布丁20163', '冷饮51867', '果酱20165', '糖水50680', '冰淇淋20166', '果冻51871'], 
    ['奶茶咖啡','饮品20136', '咖啡20168', '豆浆52088', '奶茶20169', '酒51942', '果汁51823','花草茶52332']
]

const meat=[
    ['猪肉','猪5399', '猪肉731', '排骨227', '猪肉末792', '五花肉1304', '猪蹄423', '肉丝5357', '肋排5392', '瘦肉580'],
   ['鸡','鸡104', '鸡翅1261', '鸡胸5391', '鸡腿1509', '鸡翅中5396', '鸡腿肉5194', '鸡爪1337']
,['牛','牛5443', '牛肉1445', '牛腩612', '牛排938', '肥牛2629', '牛里脊5375', '牛腱5403']
]
const vegetable=[
    ['果实类蔬菜', '彩椒601', '番茄718', '南瓜451', '玉米208', '红椒449', '茄子178', '黄瓜1364', '玉米粒5318'], 
    ['根茎蔬菜', '土豆206', '萝卜4359', '紫薯632', '红薯747', '胡萝卜1137', '山药424'], 
    ['叶类蔬菜', '芹菜725', '白菜1105', '韭菜918'], 
    ['菌菇类', '香菇468', '杏鲍菇443', '银耳1389']
]

import React from 'react';
const Section=(props)=>{
    return <div style={{display:'flex',maxWidth:900,justifyContent:'space-around',maxHeight:350}}>
        <h2 style={{lineHeight:'200px',fontSize:24,marginRight:200}}>{props.title}</h2>
        {
              props.data.map((ul,idx)=><ul key={idx} 
               style={{display:'flex',flexDirection:'column',lineHeight:2,padding:'5px 10px'}}>
                  <h3 style={{textAlign:'center'}}>{ul[0]}</h3>
                 { ul.slice(1).map((item,idx)=>{
                    let info=item.match(/([\u4e00-\u9fff]+)(\d+)/);
                    return <a href={`/#/category/${info[2]}/`} key={idx}>
                      {info[1]}
                    </a>
                  })
                  }
              </ul>)
          }
    </div>
}

export default class Category  extends React.Component{
  
  render(){
      return <div>
          <h1 style={{fontSize:35}}>分类浏览</h1>
          <hr />
          <Section title="热门专题" data={hot} />
          <hr/>
          <Section title="烘焙甜品饮料" data={cake} />
          <hr/>
          <Section title="无肉不欢" data={meat} />
          <hr/>
          <Section title="蔬菜水果" data={vegetable} />
          
      </div>
  }
}